Deep-Learning/MiMo-V2.5-Pro-on-MI300X-Benchmark/data/raw-logs/20260713-amd-tuned-moe-expanded-concurrency/points/decode/benchmark_8192_out1024_con192.log
/opt/venv/lib/python3.10/site-packages/transformers/modeling_rope_utils.py:1034: FutureWarning: `rope_config_validation` is deprecated and has been removed. Its functionality has been moved to RotaryEmbeddingConfigMixin.validate_rope method. PreTrainedConfig inherits this class, so please call self.validate_rope() instead. Also, make sure to use the new rope_parameters syntax. You can call self.standardize_rope_params() in the meantime.
  warnings.warn(
benchmark_args=Namespace(backend='sglang', base_url=None, host='<ip>', port=40000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='/data/mimo-public/ShareGPT_V3_unfiltered_cleaned_split.json', speed_bench_category=None, speed_bench_output_len=512, model='/data/models/MiMo-V2.5-Pro', served_model_name=None, tokenizer=None, num_prompts=256, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=8192, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=192, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=12345, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=True, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=32, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://<ip>:40000/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='<ip>', port=40000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='/data/mimo-public/ShareGPT_V3_unfiltered_cleaned_split.json', speed_bench_category=None, speed_bench_output_len=512, model='/data/models/MiMo-V2.5-Pro', served_model_name=None, tokenizer=None, num_prompts=256, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=8192, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=192, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=12345, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=True, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=32, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 2097152
#Output tokens: 262144
Starting warmup with 32 sequences...
Warmup completed with 32 sequences. Starting main benchmark run...

  0%|          | 0/256 [00:00<?, ?it/s]
  0%|          | 1/256 [00:10<45:39, 10.74s/it]
  1%|          | 2/256 [00:12<22:39,  5.35s/it]
  1%|          | 3/256 [00:14<16:03,  3.81s/it]
  2%|▏         | 6/256 [00:15<06:06,  1.46s/it]
  3%|▎         | 7/256 [00:17<06:37,  1.60s/it]
  4%|▍         | 10/256 [00:17<03:43,  1.10it/s]
  4%|▍         | 11/256 [00:19<04:22,  1.07s/it]
  5%|▌         | 13/256 [00:20<03:39,  1.11it/s]
  6%|▌         | 15/256 [00:21<03:07,  1.28it/s]
  7%|▋         | 18/256 [00:22<02:09,  1.84it/s]
  7%|▋         | 19/256 [00:23<02:41,  1.46it/s]
  9%|▊         | 22/256 [00:24<02:05,  1.86it/s]
  9%|▉         | 23/256 [00:26<02:37,  1.48it/s]
 11%|█         | 27/256 [00:26<01:35,  2.40it/s]
 11%|█         | 28/256 [00:28<02:03,  1.84it/s]
 12%|█▏        | 30/256 [00:29<01:58,  1.91it/s]
 13%|█▎        | 33/256 [00:30<01:40,  2.22it/s]
 13%|█▎        | 34/256 [00:31<02:08,  1.73it/s]
 15%|█▍        | 38/256 [00:32<01:28,  2.46it/s]
 15%|█▌        | 39/256 [00:33<01:56,  1.86it/s]
 16%|█▌        | 41/256 [00:33<01:25,  2.51it/s]
 17%|█▋        | 43/256 [00:33<01:11,  2.99it/s]
 17%|█▋        | 44/256 [00:35<01:41,  2.09it/s]
 18%|█▊        | 46/256 [00:36<01:37,  2.16it/s]
 19%|█▉        | 49/256 [00:36<01:09,  2.98it/s]
 20%|█▉        | 50/256 [00:37<01:36,  2.14it/s]
 21%|██        | 53/256 [00:38<01:09,  2.90it/s]
 21%|██        | 54/256 [00:39<01:35,  2.11it/s]
 23%|██▎       | 58/256 [00:40<01:13,  2.70it/s]
 23%|██▎       | 59/256 [00:41<01:35,  2.07it/s]
 25%|██▍       | 63/256 [00:41<01:01,  3.14it/s]
 25%|██▌       | 64/256 [00:43<01:23,  2.30it/s]
 26%|██▌       | 66/256 [00:44<01:26,  2.19it/s]
 27%|██▋       | 70/256 [00:44<00:55,  3.36it/s]
 28%|██▊       | 71/256 [00:45<01:15,  2.47it/s]
 29%|██▊       | 73/256 [00:46<01:11,  2.56it/s]
 29%|██▉       | 75/256 [00:47<01:18,  2.30it/s]
 31%|███       | 79/256 [00:47<00:50,  3.48it/s]
 31%|███▏      | 80/256 [00:48<01:09,  2.53it/s]
 32%|███▏      | 83/256 [00:49<00:51,  3.34it/s]
 33%|███▎      | 84/256 [00:50<01:10,  2.44it/s]
 34%|███▍      | 87/256 [00:50<00:51,  3.30it/s]
 34%|███▍      | 88/256 [00:51<01:10,  2.39it/s]
 35%|███▌      | 90/256 [00:52<01:06,  2.51it/s]
 36%|███▋      | 93/256 [00:52<00:41,  3.92it/s]
 37%|███▋      | 94/256 [00:53<00:53,  3.05it/s]
 38%|███▊      | 96/256 [00:54<00:54,  2.91it/s]
 38%|███▊      | 97/256 [00:55<01:14,  2.13it/s]
 39%|███▊      | 99/256 [00:55<01:09,  2.27it/s]
 39%|███▉      | 101/256 [00:56<01:05,  2.38it/s]
 40%|████      | 103/256 [00:57<01:03,  2.43it/s]
 41%|████      | 105/256 [00:58<01:02,  2.43it/s]
 42%|████▏     | 108/256 [00:58<00:45,  3.22it/s]
 43%|████▎     | 109/256 [00:59<01:01,  2.40it/s]
 44%|████▍     | 112/256 [01:00<00:45,  3.19it/s]
 44%|████▍     | 113/256 [01:01<01:01,  2.31it/s]
 46%|████▌     | 117/256 [01:01<00:42,  3.25it/s]
 46%|████▌     | 118/256 [01:02<00:57,  2.42it/s]
 47%|████▋     | 121/256 [01:03<00:42,  3.17it/s]
 48%|████▊     | 122/256 [01:04<00:57,  2.34it/s]
 49%|████▉     | 125/256 [01:04<00:41,  3.19it/s]
 49%|████▉     | 126/256 [01:05<00:56,  2.30it/s]
 50%|█████     | 128/256 [01:06<00:58,  2.18it/s]
 51%|█████     | 131/256 [01:07<00:46,  2.66it/s]
 52%|█████▏    | 134/256 [01:08<00:40,  3.00it/s]
 53%|█████▎    | 135/256 [01:09<00:52,  2.30it/s]
 54%|█████▍    | 139/256 [01:09<00:33,  3.54it/s]
 55%|█████▍    | 140/256 [01:10<00:44,  2.60it/s]
 56%|█████▌    | 143/256 [01:11<00:35,  3.20it/s]
 57%|█████▋    | 145/256 [01:12<00:39,  2.83it/s]
 57%|█████▋    | 147/256 [01:13<00:38,  2.82it/s]
 58%|█████▊    | 149/256 [01:13<00:38,  2.76it/s]
 59%|█████▉    | 151/256 [01:14<00:41,  2.55it/s]
 61%|██████    | 156/256 [01:16<00:35,  2.83it/s]
 62%|██████▎   | 160/256 [01:17<00:27,  3.46it/s]
 63%|██████▎   | 161/256 [01:18<00:35,  2.69it/s]
 65%|██████▍   | 166/256 [01:18<00:22,  3.91it/s]
 66%|██████▌   | 168/256 [01:19<00:24,  3.62it/s]
 66%|██████▌   | 169/256 [01:20<00:31,  2.76it/s]
 67%|██████▋   | 171/256 [01:21<00:29,  2.84it/s]
 68%|██████▊   | 173/256 [01:21<00:29,  2.79it/s]
 69%|██████▉   | 176/256 [01:22<00:21,  3.69it/s]
 69%|██████▉   | 177/256 [01:23<00:29,  2.70it/s]
 70%|███████   | 180/256 [01:23<00:21,  3.59it/s]
 71%|███████   | 181/256 [01:24<00:28,  2.64it/s]
 72%|███████▏  | 185/256 [01:25<00:19,  3.68it/s]
 73%|███████▎  | 186/256 [01:25<00:25,  2.70it/s]
 74%|███████▍  | 189/256 [01:26<00:18,  3.63it/s]
 74%|███████▍  | 190/256 [01:27<00:24,  2.65it/s]
 75%|███████▌  | 193/256 [01:27<00:19,  3.19it/s]
 76%|███████▌  | 194/256 [01:28<00:25,  2.42it/s]
 78%|███████▊  | 199/256 [01:29<00:15,  3.73it/s]
 78%|███████▊  | 200/256 [01:30<00:19,  2.81it/s]
 79%|███████▉  | 203/256 [01:30<00:14,  3.61it/s]
 80%|███████▉  | 204/256 [01:31<00:19,  2.63it/s]
 80%|████████  | 206/256 [01:32<00:20,  2.45it/s]
 82%|████████▏ | 211/256 [01:33<00:13,  3.36it/s]
 83%|████████▎ | 212/256 [01:34<00:16,  2.63it/s]
 84%|████████▎ | 214/256 [01:35<00:17,  2.42it/s]
 85%|████████▌ | 218/256 [01:36<00:11,  3.36it/s]
 86%|████████▌ | 220/256 [01:36<00:10,  3.32it/s]
 87%|████████▋ | 223/256 [01:37<00:07,  4.15it/s]
 88%|████████▊ | 224/256 [01:38<00:10,  3.08it/s]
 89%|████████▊ | 227/256 [01:38<00:06,  4.17it/s]
 89%|████████▉ | 228/256 [01:39<00:09,  3.05it/s]
 91%|█████████ | 232/256 [01:39<00:05,  4.13it/s]
 91%|█████████ | 233/256 [01:40<00:07,  3.22it/s]
 93%|█████████▎| 237/256 [01:41<00:05,  3.29it/s]
 94%|█████████▍| 241/256 [01:42<00:03,  4.66it/s]
 95%|█████████▍| 242/256 [01:42<00:03,  3.64it/s]
 95%|█████████▌| 244/256 [01:43<00:03,  3.47it/s]
 96%|█████████▋| 247/256 [01:44<00:02,  3.94it/s]
 98%|█████████▊| 251/256 [01:44<00:00,  5.80it/s]
 98%|█████████▊| 252/256 [01:44<00:00,  4.78it/s]
100%|██████████| 256/256 [01:44<00:00,  7.40it/s]
100%|██████████| 256/256 [01:44<00:00,  2.44it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 192       
Successful requests:                     256       
Benchmark duration (s):                  104.83    
Total input tokens:                      2097152   
Total input text tokens:                 2097152   
Total generated tokens:                  262144    
Total generated tokens (retokenized):    65791     
Request throughput (req/s):              2.44      
Input token throughput (tok/s):          20004.33  
Output token throughput (tok/s):         2500.54   
Peak output token throughput (tok/s):    3105.00   
Peak concurrent requests:                197       
Total token throughput (tok/s):          22504.87  
Concurrency:                             139.93    
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   57304.33  
Median E2E Latency (ms):                 63983.37  
P90 E2E Latency (ms):                    78632.97  
P95 E2E Latency (ms):                    83114.49  
P99 E2E Latency (ms):                    86681.57  
---------------Time to First Token----------------
Mean TTFT (ms):                          40956.57  
Median TTFT (ms):                        48721.85  
P90 TTFT (ms):                           61510.07  
P95 TTFT (ms):                           66241.65  
P99 TTFT (ms):                           70422.68  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          15.98     
Median TPOT (ms):                        16.78     
P90 TPOT (ms):                           17.63     
P95 TPOT (ms):                           17.71     
P99 TPOT (ms):                           17.75     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           15.98     
Median ITL (ms):                         17.00     
P90 ITL (ms):                            18.42     
P95 ITL (ms):                            18.86     
P99 ITL (ms):                            20.32     
Max ITL (ms):                            28.98     
==================================================